shakilapr/etrike/mtr-stm32/test/test_full_suite/test_mtr_full_suite.cpp
#include <cstdint>
#include <cstdio>
#include <cmath>
#include <algorithm>
#include <deque>
#include <vector>

// 1. Include STM32 HAL stub before subsystem headers
#include "stub/stm32g4xx_hal.h"
#include <unity.h>

// Define dummy global FDCAN handle needed by CanDriver extern "C"
extern "C" {
    FDCAN_HandleTypeDef hfdcan1;
}

// 2. Include actual production MTR headers
#include "mtr-stm32/src/config.h"
#include "mtr-stm32/src/relay_controller.h"
#include "mtr-stm32/src/dac_controller.h"
#include "mtr-stm32/src/motor_manager.h"
#include "mtr-stm32/src/can_driver.h"
#include "protocol/compat/can.hpp"
#include "shared_config.h"

void setUp(void) {}
void tearDown(void) {}

namespace {

int g_tests_run = 0;
int g_tests_failed = 0;

#define ASSERT_TRUE(cond) do { \
    g_tests_run++; \
    TEST_ASSERT_TRUE(cond); \
} while(0)

#define ASSERT_FALSE(cond) ASSERT_TRUE(!(cond))

#define ASSERT_EQ(val, target) do { \
    g_tests_run++; \
    TEST_ASSERT_EQUAL_INT64(static_cast<long long>(target), static_cast<long long>(val)); \
} while(0)

#define ASSERT_NEAR(val, target, eps) do { \
    g_tests_run++; \
    TEST_ASSERT_FLOAT_WITHIN(static_cast<float>(eps), static_cast<float>(target), static_cast<float>(val)); \
} while(0)

// Authority frames (0x110/0x113) require a baseline frame followed by an
// advancing frame before MotorManager's StreamValidity accepts them. Counters
// advance monotonically across all helpers so back-to-back command pairs stay
// in-sequence. Each stream keeps its OWN monotonic counter so interleaved
// send_mode/send_power calls do not jump a single stream's counter by >1.
static uint8_t g_mode_ctr = 0;
static uint8_t g_pwr_ctr = 0;
static void send_mode(mtr::MotorManager& mgr, can::Mode mode, uint32_t now) {
    const bool auto_mode = (mode == can::Mode::Auto);
    can::gen::SysModeCmd c0{auto_mode, g_mode_ctr++};
    can::Frame f0; can::gen::encode_sys_mode_cmd(c0, f0); mgr.handle_frame(f0, now);
    can::gen::SysModeCmd c1{auto_mode, g_mode_ctr++};
    can::Frame f1; can::gen::encode_sys_mode_cmd(c1, f1); mgr.handle_frame(f1, now);
}
static void send_power(mtr::MotorManager& mgr, bool on, uint32_t now) {
    can::gen::SysPwrCmd c0{on, g_pwr_ctr++};
    can::Frame f0; can::gen::encode_sys_pwr_cmd(c0, f0); mgr.handle_frame(f0, now);
    can::gen::SysPwrCmd c1{on, g_pwr_ctr++};
    can::Frame f1; can::gen::encode_sys_pwr_cmd(c1, f1); mgr.handle_frame(f1, now);
}
static void send_drive(mtr::MotorManager& mgr, int32_t speed, can::Gear gear, uint32_t now) {
    can::gen::RtDriveCmd drv{speed, static_cast<uint8_t>(gear)};
    can::Frame f; can::gen::encode_rt_drive_cmd(drv, f); mgr.handle_frame(f, now);
}

// Persistent safety authority frame (0x011 SYS_SAFETY_STS) with E2E CRC.
// Like send_mode/send_power, each call sends a baseline frame followed by an
// advancing frame: StreamValidity treats the first observation as a baseline
// (invalid) and only the second advancing frame makes the authority valid.
// A single monotonic counter keeps consecutive calls in-sequence. Two
// consecutive zero frames after a latched ESTOP form the authorized clear.
static uint8_t g_safe_ctr = 0;
static void send_safety(mtr::MotorManager& mgr, bool estop, uint32_t now) {
    for (int i = 0; i < 2; ++i) {
        can::gen::SysSafetySts msg{};
        msg.estop_active = estop;
        msg.heartbeat_ok = true;
        msg.light_left = false;
        msg.light_right = false;
        msg.light_brake = false;
        msg.light_head = false;
        msg.rolling_counter = g_safe_ctr++;
        msg.e2e_crc = 0;
        can::Frame tmp;
        can::gen::encode_sys_safety_sts(msg, tmp);
        msg.e2e_crc = static_cast<std::uint8_t>(can::e2e::sys_safety_sts_crc(tmp.data.data()));
        can::Frame f;
        can::gen::encode_sys_safety_sts(msg, f);
        mgr.handle_frame(f, now);
    }
}
// Variant: send exactly n advancing 0x011 frames (used to probe the asymmetric
// two-frame clear without the fixed 2-frame baseline+advancing helper).
static void send_safety_frames(mtr::MotorManager& mgr, bool estop, int n, uint32_t now) {
    for (int i = 0; i < n; ++i) {
        can::gen::SysSafetySts msg{};
        msg.estop_active = estop;
        msg.heartbeat_ok = true;
        msg.light_left = false;
        msg.light_right = false;
        msg.light_brake = false;
        msg.light_head = false;
        msg.rolling_counter = g_safe_ctr++;
        msg.e2e_crc = 0;
        can::Frame tmp;
        can::gen::encode_sys_safety_sts(msg, tmp);
        msg.e2e_crc = static_cast<std::uint8_t>(can::e2e::sys_safety_sts_crc(tmp.data.data()));
        can::Frame f;
        can::gen::encode_sys_safety_sts(msg, f);
        mgr.handle_frame(f, now);
    }
}
// Send 0x011 frames with a deliberately corrupted E2E CRC to simulate bus
// corruption or an impersonating node.
static void send_safety_corrupt(mtr::MotorManager& mgr, bool estop, uint32_t now) {
    for (int i = 0; i < 2; ++i) {
        can::gen::SysSafetySts msg{};
        msg.estop_active = estop;
        msg.heartbeat_ok = true;
        msg.light_left = false;
        msg.light_right = false;
        msg.light_brake = false;
        msg.light_head = false;
        msg.rolling_counter = g_safe_ctr++;
        msg.e2e_crc = 0;
        can::Frame tmp;
        can::gen::encode_sys_safety_sts(msg, tmp);
        msg.e2e_crc = static_cast<std::uint8_t>(
            can::e2e::sys_safety_sts_crc(tmp.data.data()) ^ 0xFFu);
        can::Frame f;
        can::gen::encode_sys_safety_sts(msg, f);
        mgr.handle_frame(f, now);
    }
}

// ═══════════════════════════════════════════════════════════════════════
// 1. Relay Controller: Mutual Exclusion & Active-Low Polarity
// ═══════════════════════════════════════════════════════════════════════

void test_relay_controller_mutual_exclusion() {
    std::printf("[TEST GROUP] Relay Controller: Mutual Exclusion & Polarity...\n");
    hal_mock::reset();

    mtr::RelayController relays;

    // 1. Initial State before and after init()
    relays.init();
    // After init, all relay pins (kRelayRevPin, kRelayDrivePin, kRelayIgnitionPin) must be SET (OFF)
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(relays.current_gear(), can::Gear::N);
    ASSERT_FALSE(relays.is_ignition_on());

    // Active-low check: GPIO_PIN_SET means relay is DE-ENERGIZED (OFF)
    // GPIOA pin 0 (Rev), pin 2 (Drive), pin 4 (Ignition) should all have bits set
    uint16_t all_relay_mask = mtr::kRelayRevPin | mtr::kRelayDrivePin | mtr::kRelayIgnitionPin;
    ASSERT_EQ(hal_mock::g_gpio_a_pins & all_relay_mask, all_relay_mask);

    // 2. Set to Drive (Gear::D, ignition_on = true)
    relays.set_gear(can::Gear::D, true);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_EQ(relays.current_gear(), can::Gear::D);
    ASSERT_TRUE(relays.is_ignition_on());

    // Check individual pin levels:
    // Drive pin (PA2) = RESET (0), Ignition pin (PA4) = RESET (0), Reverse pin (PA0) = SET (1)
    bool drive_pin_on = (hal_mock::g_gpio_a_pins & mtr::kRelayDrivePin) == 0;
    bool rev_pin_on   = (hal_mock::g_gpio_a_pins & mtr::kRelayRevPin) == 0;
    bool ign_pin_on   = (hal_mock::g_gpio_a_pins & mtr::kRelayIgnitionPin) == 0;

    ASSERT_TRUE(drive_pin_on);
    ASSERT_FALSE(rev_pin_on);
    ASSERT_TRUE(ign_pin_on);

    // HARD CRITICAL SAFETY CHECK: Drive and Reverse must NEVER be ON at the same time
    ASSERT_FALSE(drive_pin_on && rev_pin_on);

    // 3. Set to Reverse (Gear::R, ignition_on = true)
    relays.set_gear(can::Gear::R, true);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Reverse);
    ASSERT_EQ(relays.current_gear(), can::Gear::R);
    ASSERT_TRUE(relays.is_ignition_on());

    drive_pin_on = (hal_mock::g_gpio_a_pins & mtr::kRelayDrivePin) == 0;
    rev_pin_on   = (hal_mock::g_gpio_a_pins & mtr::kRelayRevPin) == 0;
    ign_pin_on   = (hal_mock::g_gpio_a_pins & mtr::kRelayIgnitionPin) == 0;

    ASSERT_FALSE(drive_pin_on);
    ASSERT_TRUE(rev_pin_on);
    ASSERT_TRUE(ign_pin_on);
    ASSERT_FALSE(drive_pin_on && rev_pin_on); // Mutual exclusion verified!

    // 4. Set to Park / Neutral (Gear::N, ignition_on = true)
    relays.set_gear(can::Gear::N, true);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Park);
    ASSERT_EQ(relays.current_gear(), can::Gear::N);
    ASSERT_TRUE(relays.is_ignition_on());

    drive_pin_on = (hal_mock::g_gpio_a_pins & mtr::kRelayDrivePin) == 0;
    rev_pin_on   = (hal_mock::g_gpio_a_pins & mtr::kRelayRevPin) == 0;
    ign_pin_on   = (hal_mock::g_gpio_a_pins & mtr::kRelayIgnitionPin) == 0;

    ASSERT_FALSE(drive_pin_on);
    ASSERT_FALSE(rev_pin_on);
    ASSERT_TRUE(ign_pin_on);

    // 5. Gear D with Ignition OFF -> MUST force State::Off
    relays.set_gear(can::Gear::D, false);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_FALSE(relays.is_ignition_on());
    ASSERT_EQ(hal_mock::g_gpio_a_pins & all_relay_mask, all_relay_mask);

    // 6. Status LED Toggles on state changes
    uint32_t toggles_before = hal_mock::g_led_toggle_count;
    relays.set_state(mtr::RelayController::State::Drive);
    ASSERT_EQ(hal_mock::g_led_toggle_count, toggles_before + 1);

