shakilapr/etrike/mtr-stm32/test/test_full_suite/test_mtr_full_suite.cpp
    // Re-asserting same state must NOT toggle LED
    relays.set_state(mtr::RelayController::State::Drive);
    ASSERT_EQ(hal_mock::g_led_toggle_count, toggles_before + 1);
}

// ═══════════════════════════════════════════════════════════════════════
// 2. Software I2C & MCP4725 DAC Controller
// ═══════════════════════════════════════════════════════════════════════

void test_dac_controller_software_i2c_and_clamps() {
    std::printf("[TEST GROUP] MCP4725 Software I2C & Voltage Clamping...\n");
    hal_mock::reset();

    mtr::DacController dac;
    dac.init();
    ASSERT_EQ(dac.current_code(), 0);

    // 1. Standard active write with default address 0x60 (0xC0)
    hal_mock::g_i2c_target_addr = 0x60 << 1; // 0xC0
    dac.set_throttle(1000, true);
    ASSERT_EQ(dac.current_code(), 1000);
    ASSERT_EQ(hal_mock::g_last_dac_written, 1000);

    // 2. Voltage Safety Window Clamping:
    // Minimum active code is 655 (~0.8V)
    dac.set_throttle(100, true);
    ASSERT_EQ(dac.current_code(), mtr::kDacMinCode); // Clamped to 655
    ASSERT_EQ(hal_mock::g_last_dac_written, mtr::kDacMinCode);

    dac.set_throttle(654, true);
    ASSERT_EQ(dac.current_code(), mtr::kDacMinCode);

    dac.set_throttle(655, true);
    ASSERT_EQ(dac.current_code(), 655);

    // Maximum active code is 1966 (~2.4V)
    dac.set_throttle(1966, true);
    ASSERT_EQ(dac.current_code(), mtr::kDacMaxCode);

    dac.set_throttle(2500, true);
    ASSERT_EQ(dac.current_code(), mtr::kDacMaxCode); // Clamped to 1966
    ASSERT_EQ(hal_mock::g_last_dac_written, mtr::kDacMaxCode);

    dac.set_throttle(5000, true);
    ASSERT_EQ(dac.current_code(), mtr::kDacMaxCode); // Out of 12-bit range clamped to 1966

    // 3. Zero / Disable Enforcement:
    // code = 0 -> outputs 0.0V
    dac.set_throttle(0, true);
    ASSERT_EQ(dac.current_code(), 0);
    ASSERT_EQ(hal_mock::g_last_dac_written, 0);

    // enabled = false -> outputs 0.0V regardless of requested code
    dac.set_throttle(1500, false);
    ASSERT_EQ(dac.current_code(), 0);
    ASSERT_EQ(hal_mock::g_last_dac_written, 0);

    // force_zero() -> outputs 0.0V
    dac.set_throttle(1200, true);
    ASSERT_EQ(dac.current_code(), 1200);
    dac.force_zero();
    ASSERT_EQ(dac.current_code(), 0);
    ASSERT_EQ(hal_mock::g_last_dac_written, 0);

    // 4. Multi-Address Probing & Caching (0x60, 0x61, 0x62)
    // Cache currently holds 0x60 (0xC0)
    ASSERT_EQ(dac.cached_address(), 0x60 << 1);

    // Switch target address to candidate 0x61 (0xC2)
    hal_mock::g_i2c_target_addr = 0x61 << 1;
    // Current cache holds 0x60 -> write to cached 0x60 will NACK and abort immediately,
    // invalidating cache, then candidate scan will successfully probe 0x61!
    dac.set_throttle(1400, true);
    ASSERT_EQ(dac.current_code(), 1400);
    ASSERT_EQ(hal_mock::g_last_dac_written, 1400);
    ASSERT_EQ(dac.cached_address(), 0x61 << 1);

    // 5. Total NACK: all candidates NACK
    hal_mock::g_i2c_nack_address = true;
    bool write_ok = dac.write_dac_raw(1500);
    ASSERT_FALSE(write_ok);
    ASSERT_EQ(dac.cached_address(), 0); // Cache invalidated
    hal_mock::g_i2c_nack_address = false;
}

// ═══════════════════════════════════════════════════════════════════════
// 3. Motor Manager: ESTOP & Recovery Transitions
// ═══════════════════════════════════════════════════════════════════════

void test_motor_manager_estop_and_recovery() {
    std::printf("[TEST GROUP] Motor Manager: ESTOP & Recovery...\n");
    hal_mock::reset();

    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);

    mgr.init();
    ASSERT_FALSE(mgr.is_estop_active());

    // 1. Establish normal driving state in Drive
    // Authority from SYS: mode (0x110) + power (0x113), then drive command.
    send_mode(mgr, can::Mode::Manual, 100);
    send_power(mgr, true, 100);

    // Drive command 2000 mm/s in Drive (0x204)
    can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv, drv_fr);
    mgr.handle_frame(drv_fr, 100);

    // Establish the SYS_SAFETY_STS (0x011) stream with estop_active=0 before driving.
    send_safety(mgr, false, 100);

    mgr.tick(100);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);

    // 2. Trigger ESTOP via 0x001 SAFETY_ESTOP
    can::Frame estop_fr;
    estop_fr.id = can::kIdSafetyEstop; // 0x001
    estop_fr.dlc = 0;
    mgr.handle_frame(estop_fr, 105);

    // SYS keeps reporting the latched E-stop on 0x011 while ESTOP is active.
    send_safety(mgr, true, 108);

    ASSERT_TRUE(mgr.is_estop_active());
    mgr.tick(110);

    // Relays forced to Off, DAC forced to 0V
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);

    // Gap #15 Redundant ESTOP ACK check in 0x206 MTR_MOTOR_FBK
    can::Frame fbk_fr = mgr.build_motor_feedback_frame();
    can::gen::MtrMotorFbk fbk{};
    can::gen::decode_mtr_motor_fbk(fbk_fr.view(), fbk);
    ASSERT_TRUE((fbk.fault_flags & shared::kMtrFaultEstopActive) != 0);
    ASSERT_TRUE((fbk.fault_flags & shared::kMtrFaultStartupReady) != 0);

    // 3. Recovery via SYS_SAFETY_STS (0x011) — the ONLY path that clears the
    //    latched E-stop. The 0x110 mode command no longer carries ESTOP.
    //    Two consecutive fresh, advancing frames with estop_active == 0 are
    //    required for an authorized clear (asymmetric assert/clear).
    // Two zero frames (baseline + advancing) after the latched ESTOP form the
    // authorized clear.
    send_safety(mgr, false, 110);
    ASSERT_FALSE(mgr.is_estop_active());

    // After an authorized clear the authority streams are invalidated and a REARM
    // sequence is required before propulsion is re-enabled. Re-establish mode and
    // observe a fresh 0x113 OFF->ON edge.
    send_mode(mgr, can::Mode::Manual, 115); // re-establish mode authority (fresh 0x110)
    send_power(mgr, false, 115);            // REARM off phase
    send_power(mgr, true, 115);             // REARM on edge -> rearm_observed

    // Now tick again with valid drive frame -> Motor resumes!
    mgr.handle_frame(drv_fr, 120);
    mgr.tick(120);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);
}

