shakilapr/etrike/mtr-stm32/test/test_full_suite/test_mtr_full_suite.cpp
// ═══════════════════════════════════════════════════════════════════════
// 4. Motor Manager: Direction Shift Arc-Protection Dwell (50 ms)
// ═══════════════════════════════════════════════════════════════════════

void test_motor_manager_direction_shift_dwell() {
    std::printf("[TEST GROUP] Direction Shift Arc-Protection Dwell (50 ms)...\n");
    hal_mock::reset();

    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);
    mgr.init();

    // Authority from SYS: mode (0x110) + power (0x113)
    send_mode(mgr, can::Mode::Manual, 100);
    send_power(mgr, true, 100);

    // 1. Cruising in Drive (D) at 1500 mm/s
    can::gen::RtDriveCmd drv_cmd{1500, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv_cmd, drv_fr);
    mgr.handle_frame(drv_fr, 100);
    send_safety(mgr, false, 100); // establish 0x011 stream (estop_active=0)
    mgr.tick(100);

    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);

    // 2. Immediate reversal requested: shift to Reverse (R) at t = 200 ms
    can::gen::RtDriveCmd rev_cmd{300, static_cast<uint8_t>(can::Gear::R)};
    can::Frame rev_fr;
    can::gen::encode_rt_drive_cmd(rev_cmd, rev_fr);
    mgr.handle_frame(rev_fr, 200);

    // First tick at t = 200 ms (direction shift detected):
    mgr.tick(200);

    // Arc-protection dwell MUST immediately drop DAC to 0 and shift relays to Neutral (Park)
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Park);
    ASSERT_EQ(dac.current_code(), 0);

    // 3. Check during dwell: at t = 230 ms (30 ms elapsed < 50 ms dwell)
    mgr.tick(230);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Park); // Still in neutral!
    ASSERT_EQ(dac.current_code(), 0);

    // 4. Check at expiration of dwell: at t = 250 ms (50 ms elapsed = kShiftDwellMs)
    mgr.tick(250);
    // Dwell complete! Reverse relay now energizes and DAC activates!
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Reverse);
    ASSERT_TRUE(dac.current_code() > 0);

    // 5. Shift back from Reverse (R) to Drive (D) at t = 300 ms
    mgr.handle_frame(drv_fr, 300);
    mgr.tick(300);

    // Must immediately enter neutral dwell with DAC 0
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Park);
    ASSERT_EQ(dac.current_code(), 0);

    // At t = 325 ms (mid-dwell)
    mgr.tick(325);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Park);
    ASSERT_EQ(dac.current_code(), 0);

    // At t = 350 ms (dwell finished)
    mgr.tick(350);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);
}

// ═══════════════════════════════════════════════════════════════════════
// 5. Motor Manager: Comms Watchdog Timeout (500 ms)
// ═══════════════════════════════════════════════════════════════════════

void test_motor_manager_watchdog_timeout() {
    std::printf("[TEST GROUP] Comms Watchdog Timeout (500 ms)...\n");
    hal_mock::reset();

    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);
    mgr.init();

    // Authority from SYS: mode (0x110) + power (0x113)
    send_mode(mgr, can::Mode::Manual, 1000);
    send_power(mgr, true, 1000);

    // Drive command at t = 1000 ms
    can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv, drv_fr);
    mgr.handle_frame(drv_fr, 1000);
    send_safety(mgr, false, 1000); // establish 0x011 stream (estop_active=0)
    mgr.tick(1000);

    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);

    // Elapsed 500 ms (t = 1500 ms) without new frames -> exactly at threshold, not timed out
    mgr.tick(1500);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);

    // Elapsed 501 ms (t = 1501 ms) -> TIMEOUT!
    mgr.tick(1501);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);

    // At t = 1800 ms (still silent)
    mgr.tick(1800);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);

    // Frame resumes at t = 2000 ms -> Watchdog recovers automatically.
    // Re-establish all authority streams (mode/power/safety) after the silence.
    send_mode(mgr, can::Mode::Manual, 2000);
    send_power(mgr, true, 2000);
    send_safety(mgr, false, 2000);
    mgr.handle_frame(drv_fr, 2000);
    mgr.tick(2000);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);
}

// ═══════════════════════════════════════════════════════════════════════
// 6. Motor Manager: Speed-to-DAC Curve & Reverse Magnitude
// ═══════════════════════════════════════════════════════════════════════

void test_motor_manager_dac_curves() {
    std::printf("[TEST GROUP] Speed-to-DAC Transfer Curves & Reverse Scaling...\n");
    hal_mock::reset();

    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);
    mgr.init();

    // Authority from SYS: mode (0x110) + power (0x113)
    send_mode(mgr, can::Mode::Manual, 100);
    send_power(mgr, true, 100);

    // Forward curve: 0 .. 3000 mm/s -> 655 .. 1966
    // Zero speed in Drive -> DAC 0
    can::gen::RtDriveCmd drv{0, static_cast<uint8_t>(can::Gear::D)};
    can::Frame fr;
    can::gen::encode_rt_drive_cmd(drv, fr);
    mgr.handle_frame(fr, 100);
    send_safety(mgr, false, 100); // establish 0x011 stream (estop_active=0)
    mgr.tick(100);
    ASSERT_EQ(dac.current_code(), 0);

    // 1500 mm/s (50% forward) -> midpoint = 700 + 0.5 * (1966 - 700) = 1333
    drv.motor_speed_mmps = 1500;
    can::gen::encode_rt_drive_cmd(drv, fr);
    mgr.handle_frame(fr, 100);
    mgr.tick(100);
    ASSERT_NEAR(dac.current_code(), 1333, 5);

    // 3000 mm/s (100% forward) -> max code 1966
    drv.motor_speed_mmps = 3000;
    can::gen::encode_rt_drive_cmd(drv, fr);
    mgr.handle_frame(fr, 100);
    mgr.tick(100);
    ASSERT_EQ(dac.current_code(), mtr::kDacMaxCode);

    // Over-speed 4000 mm/s -> clamped to 1966
    drv.motor_speed_mmps = 4000;
    can::gen::encode_rt_drive_cmd(drv, fr);
    mgr.handle_frame(fr, 100);
    mgr.tick(100);
    ASSERT_EQ(dac.current_code(), mtr::kDacMaxCode);

    // Reverse curve: max reverse speed = 500 mm/s
    // Shift to Reverse (dwell 50ms first)
    drv.gear = static_cast<uint8_t>(can::Gear::R);
    drv.motor_speed_mmps = -250; // 50% reverse speed (negative)
    can::gen::encode_rt_drive_cmd(drv, fr);
    mgr.handle_frame(fr, 100);
    mgr.tick(100); // starts dwell
    mgr.tick(160); // dwell complete

    // Midpoint reverse (-250 mm/s) -> midpoint = 1333
    ASSERT_NEAR(dac.current_code(), 1333, 5);

    // Max reverse speed (-500 mm/s) -> 1966
    drv.motor_speed_mmps = -500;
    can::gen::encode_rt_drive_cmd(drv, fr);
    mgr.handle_frame(fr, 160);
    mgr.tick(160);
    ASSERT_EQ(dac.current_code(), mtr::kDacMaxCode);

    // Positive magnitude in Reverse (+500 mm/s) -> 1966
    drv.motor_speed_mmps = 500;
    can::gen::encode_rt_drive_cmd(drv, fr);
    mgr.handle_frame(fr, 160);
    mgr.tick(160);
    ASSERT_EQ(dac.current_code(), mtr::kDacMaxCode);
}

