shakilapr/etrike/mtr-stm32/test/test_full_suite/test_mtr_full_suite.cpp
    // Latch ESTOP via 0x001 + 0x011.
    can::Frame estop_fr;
    estop_fr.id = can::kIdSafetyEstop;
    estop_fr.dlc = 0;
    mgr.handle_frame(estop_fr, 105);
    send_safety(mgr, true, 108);
    ASSERT_TRUE(mgr.is_estop_active());

    // A SINGLE zero frame must NOT clear (asymmetric: baseline + advancing).
    send_safety_frames(mgr, false, 1, 110);
    ASSERT_TRUE(mgr.is_estop_active());
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);

    // Only the second consecutive zero frame completes the authorized clear.
    send_safety_frames(mgr, false, 1, 112);
    ASSERT_FALSE(mgr.is_estop_active());
}

// ═══════════════════════════════════════════════════════════════════════
// 7d. Motor Manager: loss of the 0x011 safety stream fails safe even while
//     drive/mode/power authorities remain fresh (independent freshness).
// ═══════════════════════════════════════════════════════════════════════
void test_motor_manager_safety_stream_freshness_fail_safe() {
    std::printf("[TEST GROUP] Motor Manager: 0x011 stream loss fails safe...\n");
    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);
    mgr.init();

    send_mode(mgr, can::Mode::Manual, 100);
    send_power(mgr, true, 100);
    send_safety(mgr, false, 100);
    can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv, drv_fr);
    mgr.handle_frame(drv_fr, 100);
    mgr.tick(100);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);

    // Keep drive, mode and power authorities fresh (within their windows) but
    // let only the 0x011 safety stream go silent past kSafetyFreshMs (700 ms).
    send_mode(mgr, can::Mode::Manual, 880);
    send_power(mgr, true, 880);
    mgr.handle_frame(drv_fr, 880);
    mgr.tick(900);  // 900 - 100 (last 0x011) = 800 > 700 -> safety stream stale
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);
}

// ═══════════════════════════════════════════════════════════════════════
// 7e. Motor Manager: a corrupted (bad E2E CRC) 0x011 frame invalidates the
//     safety authority and fails safe even though drive is still fresh.
// ═══════════════════════════════════════════════════════════════════════
void test_motor_manager_safety_crc_corruption_fail_safe() {
    std::printf("[TEST GROUP] Motor Manager: 0x011 CRC corruption fails safe...\n");
    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);
    mgr.init();

    send_mode(mgr, can::Mode::Manual, 100);
    send_power(mgr, true, 100);
    send_safety(mgr, false, 100);
    can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv, drv_fr);
    mgr.handle_frame(drv_fr, 100);
    mgr.tick(100);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);

    // Corrupt 0x011 (bad CRC) — authority must be rejected. Keep mode/power/
    // drive fresh so the only failing authority is the safety stream.
    send_safety_corrupt(mgr, false, 880);
    send_mode(mgr, can::Mode::Manual, 880);
    send_power(mgr, true, 880);
    mgr.handle_frame(drv_fr, 880);
    mgr.tick(900);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);
}

// ═══════════════════════════════════════════════════════════════════════
// 7f. Motor Manager: after an authorized clear, propulsion stays OFF until a
//     fresh REARM (0x113 OFF->ON) sequence is observed.
// ═══════════════════════════════════════════════════════════════════════
void test_motor_manager_recovery_requires_rearm() {
    std::printf("[TEST GROUP] Motor Manager: clear requires REARM gate...\n");
    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);
    mgr.init();

    send_mode(mgr, can::Mode::Manual, 100);
    send_power(mgr, true, 100);
    send_safety(mgr, false, 100);
    can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv, drv_fr);
    mgr.handle_frame(drv_fr, 100);
    mgr.tick(100);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);

    // Latch ESTOP.
    can::Frame estop_fr;
    estop_fr.id = can::kIdSafetyEstop;
    estop_fr.dlc = 0;
    mgr.handle_frame(estop_fr, 105);
    send_safety(mgr, true, 108);
    ASSERT_TRUE(mgr.is_estop_active());

    // Authorized clear via two zero 0x011 frames.
    send_safety(mgr, false, 110);
    ASSERT_FALSE(mgr.is_estop_active());

    // Cleared, but propulsion must remain OFF until REARM is observed.
    mgr.handle_frame(drv_fr, 115);
    mgr.tick(115);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);

    // Fresh REARM: 0x110 mode + 0x113 OFF then ON edge.
    send_mode(mgr, can::Mode::Manual, 120);
    send_power(mgr, false, 120);
    send_power(mgr, true, 120);
    mgr.handle_frame(drv_fr, 120);
    mgr.tick(120);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);
}

// ═══════════════════════════════════════════════════════════════════════
// 8. FDCAN Driver: FIFO 0 Ringbuffer Mechanics
// ═══════════════════════════════════════════════════════════════════════

void test_fdcan_driver_ringbuffer() {
    std::printf("[TEST GROUP] FDCAN Driver: Ringbuffer & Filter Mechanics...\n");
    fdcan_mock::reset();

    mtr::CanDriver driver(hfdcan1);
    ASSERT_TRUE(driver.init());

    // Test FIFO push and poll
    can::Frame fr_out;
    ASSERT_FALSE(driver.poll_rx(fr_out)); // Empty ringbuffer

    // Inject 3 frames via ISR callback
    for (uint32_t id : {0x001u, 0x110u, 0x204u}) {
        fdcan_mock::MockMsg m{};
        m.id = id;
        m.ext = false;
        m.dlc = 8;
        m.data[0] = static_cast<uint8_t>(id & 0xFF);
        fdcan_mock::g_rx_queue.push_back(m);
    }

    driver.handle_rx_fifo0_isr();

    // Verify FIFO ordering: 0x001, 0x110, 0x204
    ASSERT_TRUE(driver.poll_rx(fr_out));
    ASSERT_EQ(fr_out.id, 0x001u);

    ASSERT_TRUE(driver.poll_rx(fr_out));
    ASSERT_EQ(fr_out.id, 0x110u);

    ASSERT_TRUE(driver.poll_rx(fr_out));
    ASSERT_EQ(fr_out.id, 0x204u);

