shakilapr/etrike/mtr-stm32/test/test_full_suite/test_mtr_full_suite.cpp
    ASSERT_FALSE(driver.poll_rx(fr_out)); // Exhausted

    // Test Ringbuffer Overflow (size is 32)
    // Push 35 frames
    for (int i = 0; i < 35; ++i) {
        fdcan_mock::MockMsg m{};
        m.id = 0x204u;
        m.ext = false;
        m.dlc = 1;
        fdcan_mock::g_rx_queue.push_back(m);
    }
    driver.handle_rx_fifo0_isr();

    // Should detect overflow and count drops
    ASSERT_TRUE(driver.rx_overflow() > 0);

    // Test Transmit path
    can::Frame tx_frame(0x206, false, 4);
    tx_frame.data[0] = 0xAA;
    ASSERT_TRUE(driver.send(tx_frame));
    ASSERT_EQ(driver.tx_count(), 1u);
    ASSERT_EQ(fdcan_mock::g_tx_msgs.size(), 1u);
    ASSERT_EQ(fdcan_mock::g_tx_msgs[0].id, 0x206u);
}

// ═══════════════════════════════════════════════════════════════════════
// 7g. Motor Manager: SYS asserts the E-stop purely via 0x011 estop_active
//     (the SYS_SAFETY_STS authority) — NO 0x001 SAFETY_ESTOP needed. This is
//     the SYS->MTR cross-node estop propagation (item #8): when SYS decides to
//     halt, it reports estop_active = 1 on 0x011 and the motor MUST cut.
// ═══════════════════════════════════════════════════════════════════════
void test_motor_manager_sys_estop_via_safety_status() {
    std::printf("[TEST GROUP] Motor Manager: SYS 0x011 estop_active cuts motor (#8)...\n");
    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);
    mgr.init();

    // Normal driving in Drive with all authorities fresh (mode/power/0x011).
    send_mode(mgr, can::Mode::Manual, 100);
    send_power(mgr, true, 100);
    send_safety(mgr, false, 100);
    can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv, drv_fr);
    mgr.handle_frame(drv_fr, 100);
    mgr.tick(100);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);

    // SYS reports estop_active = 1 on 0x011 (no 0x001 SAFETY_ESTOP anywhere).
    send_safety(mgr, true, 108);
    ASSERT_TRUE(mgr.is_estop_active());
    mgr.tick(110);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off); // motor CUT
    ASSERT_EQ(dac.current_code(), 0);

    // Two consecutive fresh zero 0x011 frames -> authorized clear.
    send_safety(mgr, false, 120);
    ASSERT_FALSE(mgr.is_estop_active());

    // Landing stays OFF until a fresh REARM (0x113 OFF->ON) is observed.
    mgr.handle_frame(drv_fr, 125);
    mgr.tick(125);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);

    // Fresh REARM -> motor resumes.
    send_mode(mgr, can::Mode::Manual, 130);
    send_power(mgr, false, 130);
    send_power(mgr, true, 130);
    mgr.handle_frame(drv_fr, 130);
    mgr.tick(130);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);
}

// ═══════════════════════════════════════════════════════════════════════
// Issue #2: dedicated 0x204 RT_DRIVE_CMD watchdog. The generic "any CAN frame
// within 500 ms" deadman must NOT be the only thing protecting propulsion:
// a frozen 0x204 while 0x110/0x113/0x011 stay alive must trip a fail-safe
// disable within the dedicated window, and it must recover only after N
// consecutive valid 0x204 frames at plausible cadence.
// ═══════════════════════════════════════════════════════════════════════
void test_motor_manager_drive_cmd_watchdog() {
    std::printf("[TEST GROUP] Motor Manager: dedicated 0x204 drive-command watchdog (#2)...\n");

    // ── A: drive in AUTO, then 0x204 goes stale while authority stays fresh ──
    {
        mtr::RelayController relays;
        mtr::DacController dac;
        mtr::MotorManager mgr(relays, dac);
        mgr.init();

        send_mode(mgr, can::Mode::Auto, 100);
        send_power(mgr, true, 100);
        send_safety(mgr, false, 100);
        can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
        can::Frame drv_fr;
        can::gen::encode_rt_drive_cmd(drv, drv_fr);
        mgr.handle_frame(drv_fr, 100);
        mgr.tick(100);
        ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
        ASSERT_TRUE(dac.current_code() > 0);
        ASSERT_TRUE(mgr.is_drive_expected());
        ASSERT_FALSE(mgr.is_drive_cmd_timed_out());

        // Keep 0x110/0x113/0x011 alive but STOP sending 0x204. At 5 ms tick cadence,
        // step in 20 ms increments re-feeding authority. Drive timeout = 150 ms.
        uint32_t now = 100;
        for (uint32_t step = 0; step < 8; ++step) {  // 8 * 20ms = 160ms
            now += 20;
            // Keep authority streams fresh (must keep advancing counters).
            send_mode(mgr, can::Mode::Auto, now);
            send_power(mgr, true, now);
            send_safety(mgr, false, now);
            mgr.tick(now);
        }
        // >150 ms with no 0x204 while authority alive -> dedicated watchdog trips.
        ASSERT_TRUE(mgr.is_drive_cmd_timed_out());
        ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
        ASSERT_EQ(dac.current_code(), 0);

        // 0x206 feedback must expose the command-timeout fault flag (0x02).
        can::Frame fbk = mgr.build_motor_feedback_frame();
        can::gen::MtrMotorFbk fbk_dec{};
        ASSERT_EQ(can::gen::decode_mtr_motor_fbk(fbk.view(), fbk_dec), can::gen::CodecStatus::Ok);
        ASSERT_TRUE((fbk_dec.fault_flags & shared::kMtrFaultCmdTimeout) != 0);

        // ── Confirmed recovery: one stray frame must NOT release the latch ──
        mgr.handle_frame(drv_fr, now);  // frame 1 (single)
        mgr.tick(now);
        ASSERT_TRUE(mgr.is_drive_cmd_timed_out());

        // Two more consecutive valid frames at cadence complete the 3-frame recovery.
        now += 20;
        mgr.handle_frame(drv_fr, now);  // frame 2
        mgr.tick(now);
        now += 20;
        mgr.handle_frame(drv_fr, now);  // frame 3
        mgr.tick(now);
        ASSERT_FALSE(mgr.is_drive_cmd_timed_out());
        // Authority kept fresh throughout: motor may resume on a fresh valid drive.
        send_mode(mgr, can::Mode::Auto, now);
        send_power(mgr, true, now);
        send_safety(mgr, false, now);
        mgr.tick(now);
        ASSERT_TRUE(dac.current_code() > 0);
    }

