shakilapr/etrike/mtr-stm32/test/test_full_suite/test_mtr_full_suite.cpp
    // 2. Send Safety (0x011) so safety state is valid
    send_safety(mgr, false, now);

    // 3. Send Drive (0x204) before Power - out of order
    mgr.handle_frame(drv_fr, now);
    mgr.tick(now);
    // Even if drive frame is parsed, power is missing
    ASSERT_FALSE(mgr.is_motor_ready());
    ASSERT_TRUE(mgr.propulsion_inhibited());
    ASSERT_EQ(dac.current_code(), 0);

    // 4. Send Power ON (0x113)
    send_power(mgr, true, now);
    // Send another drive frame with power now on
    mgr.handle_frame(drv_fr, now);
    mgr.tick(now);

    // Now all streams are present: MODE, POWER, DRIVE
    ASSERT_TRUE(mgr.is_motor_ready());
    ASSERT_FALSE(mgr.propulsion_inhibited());
    ASSERT_TRUE(dac.current_code() > 0);

    // 5. Trip ESTOP -> all readiness bits must be wiped immediately
    send_safety(mgr, true, now + 20);
    now += 20;
    mgr.tick(now);
    ASSERT_TRUE(mgr.is_estop_active());
    ASSERT_EQ(mgr.ready_mask(), 0);
    ASSERT_FALSE(mgr.is_motor_ready());
    ASSERT_TRUE(mgr.propulsion_inhibited());
    ASSERT_EQ(dac.current_code(), 0);

    // 6. Clear ESTOP via two consecutive 0 frames
    send_safety_frames(mgr, false, 2, now + 20);
    now += 40;
    mgr.tick(now);
    ASSERT_FALSE(mgr.is_estop_active());
    // Cleared ESTOP requires REARM, readiness mask must still lack power
    ASSERT_FALSE(mgr.is_motor_ready());
    ASSERT_TRUE(mgr.propulsion_inhibited());

    // 7. Re-feed mode and power OFF->ON (satisfying REARM)
    send_mode(mgr, can::Mode::Auto, now);
    send_power(mgr, false, now); // OFF edge
    mgr.tick(now);
    ASSERT_FALSE(mgr.is_motor_ready());

    now += 20;
    send_power(mgr, true, now);  // ON edge
    mgr.tick(now);
    // Still waiting for fresh drive setpoint
    ASSERT_FALSE(mgr.is_motor_ready());
    ASSERT_TRUE(mgr.propulsion_inhibited());

    // 8. Fresh drive command arrives
    mgr.handle_frame(drv_fr, now);
    mgr.tick(now);
    ASSERT_TRUE(mgr.is_motor_ready());
    ASSERT_FALSE(mgr.propulsion_inhibited());
    ASSERT_TRUE(dac.current_code() > 0);
}

} // namespace

// ═══════════════════════════════════════════════════════════════════════
// Main Entry Point
// ═══════════════════════════════════════════════════════════════════════

int main() {
    UNITY_BEGIN();

    RUN_TEST(test_relay_controller_mutual_exclusion);
    RUN_TEST(test_dac_controller_software_i2c_and_clamps);
    RUN_TEST(test_motor_manager_estop_and_recovery);
    RUN_TEST(test_motor_manager_direction_shift_dwell);
    RUN_TEST(test_motor_manager_watchdog_timeout);
    RUN_TEST(test_motor_manager_dac_curves);
    RUN_TEST(test_motor_manager_dac_golden_vectors);
    RUN_TEST(test_motor_manager_mode_cmd_does_not_clear_estop);
    RUN_TEST(test_motor_manager_asymmetric_clear_requires_two_frames);
    RUN_TEST(test_motor_manager_safety_stream_freshness_fail_safe);
    RUN_TEST(test_motor_manager_safety_crc_corruption_fail_safe);
    RUN_TEST(test_motor_manager_recovery_requires_rearm);
    RUN_TEST(test_motor_manager_sys_estop_via_safety_status);
    RUN_TEST(test_motor_manager_drive_cmd_watchdog);
    RUN_TEST(test_motor_manager_rearm_timeout_stays_inhibited);
    RUN_TEST(test_motor_manager_multi_stream_readiness_latch);
    RUN_TEST(test_fdcan_driver_ringbuffer);

    return UNITY_END();
}
